<a href="https://colab.research.google.com/github/yooste/SOLUX_summer_data/blob/master/1%EC%A3%BC%EC%B0%A8/pandas_chap05_0725.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [3]:
friend_list = [
               ['name', ['John', 'Jenny', 'Nate']],
               ['age', [20, 30, 30]],
               ['job', ['student', 'developer', 'teacher']]
]
from collections import OrderedDict
df = pd.DataFrame.from_dict(OrderedDict(friend_list))

In [4]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [5]:
df[1:3]   # 1, 2번 인덱스를 불러온다. 결과 값을 바꾸지는 않는다.

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [6]:
df = df[1:3]  # 1, 2번 인덱스를 불러오고 df에 저장한다.
df

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [9]:
friend_list = [
               ['name', ['John', 'Jenny', 'Nate']],
               ['age', [20, 30, 30]],
               ['job', ['student', 'developer', 'teacher']]
]
df = pd.DataFrame.from_dict(OrderedDict(friend_list))
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [10]:
df.loc[[0,2]]   # 불연속적인 인덱스를 불러오기 위해서는 loc 함수를 사용한다.

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [11]:
df = df.loc[[0,2]]
df

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [12]:
friend_list = [
               ['name', ['John', 'Jenny', 'Nate']],
               ['age', [20, 30, 30]],
               ['job', ['student', 'developer', 'teacher']]
]
df = pd.DataFrame.from_dict(OrderedDict(friend_list))
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

**by column condition**

In [13]:
# column의 조건에 따라 row index 선택하기
df[df.age>25]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [14]:
df.query('age>25')

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [15]:
df[ (df.age>25) & (df.name=='Nate')]

   name  age      job
2  Nate   30  teacher

**Filter Column**

**by index**

In [17]:
friend_list = [
               ['John', 20, 'student'],
               ['Jenny', 30, 'developer'],
               ['Nate', 30, 'teacher']
]
df = pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [18]:
df.iloc[:, 0:2]   # row은 다 가져오고, column는 0,1번만 가져온다.

       0   1
0   John  20
1  Jenny  30
2   Nate  30

In [19]:
df.iloc[0:2, 0:2]

       0   1
0   John  20
1  Jenny  30

**by column name**

In [23]:
 df = pd.read_csv('friend_list_no_head.csv', header = None, names = ['name', 'age', 'job'])

In [24]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [25]:
df_filtered = df[['name', 'age']]   # name과 age의 column만 가져온다.

In [26]:
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [27]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [28]:
df.filter(items = ['age','job'])    # filter 함수를 사용하여 필요한 아이템들만 가져온다.

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [29]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [30]:
df.filter(like='a', axis=1)   # column name에 a가 들어간 것(name, age)만 가져오기

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [32]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [33]:
df.filter(regex='b$', axis=1)   # regex를 활용하여 column name이 b로 끝나는 아이템만 가져오기

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern